# Reshaping DataFrames Using Pandas

## Outline
* Pivoting dataframes
* Melting dataframes

## Pivoting DataFrames

The pivot() function is used to reshape a given DataFrame organized by given index / column values. The pivot method lets us specify which column to use as an index and which column to use to define columns in a new DataFrame.

The pivot methed takes three parameters:

- **index**: Which column should be used to identify and order your rows vertically
- **columns**: Which column should be used to create the new columns in our reshaped DataFrame. Each unique value in the column stated here will create a column in our new DataFrame.
- **values**: Which column(s) should be used to fill the values in the cells of our DataFrame.

In [1]:
import pandas as pd

df = pd.DataFrame({'year': ['one', 'one', 'one', 'two', 'two',
                         'two'],
                   'average': ['A', 'B', 'C', 'A', 'B', 'C'],
                    'student_name': ["John", "Alex", "Teresa", "Amber", "Joe", "Mary"],
                    'age': ['18', '19', '20', '21', '22', '23']})
df.head(6)

  year average student_name age
0  one       A         John  18
1  one       B         Alex  19
2  one       C       Teresa  20
3  two       A        Amber  21
4  two       B          Joe  22
5  two       C         Mary  23

In [2]:
df.pivot(index = 'year', columns = 'average', values = 'student_name')

average      A     B       C
year
one       John  Alex  Teresa
two      Amber   Joe    Mary

In [3]:
df.pivot(index = 'year', columns = 'average', values = 'age')

average   A   B   C
year
one      18  19  20
two      21  22  23

# Melting dataframes


Pandas `dataframe.melt()` function unpivots a DataFrame from wide format to long format, optionally leaving identifier variables set.

This function is useful to massage a DataFrame into a format where one or more columns are *identifier variables* (`id_vars`), while all other columns, considered *measured variables* (`value_vars`), are “unpivoted” to the row axis, leaving just two non-identifier columns, ‘variable’ and ‘value’.

Our data currently has a different column for each variable, or "wide format".  Use `DataFrame.melt()` to convert it to long form, where the resulting table will have a "variable" column containing the variable name, and a "value" column containing the value of that variable.

Pick the identifying columns for the `id_vars` argument, and include all variables you want unpivoted in `value_vars`.

In [4]:
 # Use melt() function to set column “A” as the identifier variable and column “B” as value variable.
    
df2 = pd.DataFrame({"Job Position":['Data Scientist', 'Professor', 'Business Analyst', 'Computer Engineer'],  
                   "Salary":[130, 110, 90, 100],  
                   "Start Date":[2017, 2019, 2020, 2019],  
                   "Performance Rating":[4, 3.5, 3.7, 4]}) 

df2

        Job Position  Salary  Start Date  Performance Rating
0     Data Scientist     130        2017                 4.0
1          Professor     110        2019                 3.5
2   Business Analyst      90        2020                 3.7
3  Computer Engineer     100        2019                 4.0

In [5]:
df2.melt(id_vars = ["Job Position"], value_vars = ["Start Date"])

        Job Position    variable  value
0     Data Scientist  Start Date   2017
1          Professor  Start Date   2019
2   Business Analyst  Start Date   2020
3  Computer Engineer  Start Date   2019

`melt()` will also assume all columns are `value_vars` if they aren't included as `id_vars`. Use `var_name` and `value_name` to control the names of the output dataframe columns.

In [6]:
# function to unpivot the dataframe 
# also provide a customized name to the value and variable column 

df2_melt = df2.melt(id_vars = ["Job Position"], value_vars =["Start Date", "Salary"], var_name = "Variable Column",\
        value_name = "Value Column")

Predictably, the resulting dataframe has a row count equal to the original number of rows multiplied by the number of features included as `value_vars`.

In [ ]:
if len(df2_melt) == len(df2) * 2: # there are 3 feature variables that we are melting
    print('okay!')
else:
    print('ERROR')

## Summary

- We can reshape dataframes using the function pivot
- We can change a dataframe from wide to long format by melting dataframes.